<br>
<img align="left" width="300" src="sql.png">

# SQL Tutorial  

### Table of contents

1. [Introduction](#Introduction)
1. [Using Python](#Using-Python)
1. [Commands](#Commands)

## Introduction
[[go back to the top]](#Table-of-contents)

This tutorial is based on this [great tutorial by Dataquest](https://www.dataquest.io/blog/sql-fundamentals/) but many other references were used. A few important point are:
- If our data is stored in a database, the language we use is called `SQL` (structured query language). 
- Each unique request is expressed in SQL as a single query. After we write the query, we ask the database management system (DBMS) to run it and display the corresponding results.
- A relational database stores related information using multiple tables. It allows us to query at the same time information in more than one table

## Using Python
[[go back to the top]](#Table-of-contents)

We will connect to the `SQLite` database using `Python` as follows. First we import `sqlite`:

In [1]:
import sqlite3
import pandas as pd

We then connect with the database:

In [6]:
titanic = sqlite3.connect('titanic.db')

Using `pandas` function `read_sql_query` we can quickly see our query as a `DataFrame`:

In [17]:
def query_dataframe(query, database):
    return pd.read_sql_query(query, database)

We'll be working with thr famous titanic dataset.

 ## Commands
[[go back to the top]](#Table-of-contents)

The command `SELECT` tells the database the columns we want specifying them by name (we can use the wildcard * to select all columns). Naturally we must specify the the database and we do it using `FROM`

In [25]:
query = 'SELECT * FROM titanic;'
query_dataframe(query, titanic).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,None,S

Notice the semicolon in the end that the language requires. Let us count the number of NULL values in the column `Cabin`.

In [24]:
query = 'SELECT COUNT(*) FROM titanic WHERE Cabin IS NULL;'
print('Number of null values in the Cabin colum:')
nulls_cabin = query_dataframe(query, titanic)
nulls_cabin.columns = ['Nulls in Cabin']
nulls_cabin

Number of null values in the Cabin colum:

   Nulls in Cabin
0             687

# TO BE CONTINUED